def task_1():
    my_list = list(range(5)) # Створюємо список з 5 цілих чисел
    print("До:", my_list) # Виведення результату перед результатом
    for i in range(len(my_list)): # функція len повертає кількіть елементів у списку my_list і функція range генерує відповідну кількість значень що отримала від функції len.
        my_list[i] = float(my_list[i]) # Звертаємося до кожного елементу зі списку за допомогою індексу
    
    print("Після:", my_list) # Виводимо результат

def task_2(n):
    if n == 0: # Перевіряємо умови
        return 0
    if n == 1:
        return 1
    
    a, b = 0, 1 # Початкові значення 
    
    for _ in range(2, n+1): # Починаємо цикл з 2 тому що перших 2 початкових числа вже відомі і також використовуємо n+1 тому що індексація починається з 0
        a, b = b, a + b # змінній a призначаємо елемент змінної b а змінній b призначаємо суму двох елементів використовуючи метод розпакування
    print(b) # Виводимо результат
    

def task_3(a):
    fact = 1
    while(a > 0):
        fact = a * fact
        a = a - 1
    print(f"Factorial is {fact}")


task_3(4)
    